package me.gitai.smscodehelper.utils;

import com.alibaba.fastjson.JSON;

import junit.framework.TestCase;

import java.util.ArrayList;
import java.util.List;

import me.gitai.smscodehelper.bean.MSG;

/**
 * Created by gitai on 16-1-5.
 */
public class CaptchasTest extends TestCase {
    List<MSG> list = new ArrayList<>();
    public void testCaptchas() throws Exception{
        initList();
        for (MSG msg:list) {
            MSG _msg = new Captchas(new MSG(msg.getAddress(), msg.getBody()), Captchas.PARSE_TYPE_AUTO).parseAuto();
            assertEquals(msg.getCode(), _msg.getCode());
        }
    }

    private void initList() throws Exception {
        list = JSON.parseArray("[{\n" +
                "\t\"address\": \"test\",\n" +
                "\t\"body\": \"您的随机密码为:187644\",\n" +
                "\t\"code\": \"187644\"\n" +
                "}, {\n" +
                "\t\"address\": \"1065501055952\",\n" +
                "\t\"body\": \"【饿了么】您的验证码是935755，在5分钟内有效。如非本人操作请忽略本短信。\",\n" +
                "\t\"code\": \"935755\"\n" +
                "}, {\n" +
                "\t\"address\": \"95188\",\n" +
                "\t\"body\": \"2016年01月03日，您申请的手机校验码是375024。如非本人操作，请致电95188。【支付宝】\",\n" +
                "\t\"code\": \"375024\"\n" +
                "}, {\n" +
                "\t\"address\": \"18919635560\",\n" +
                "\t\"body\": \"【邮储银行】您正在使用邮储银行支付宝快捷支付，验证码：649844,付款金额%d.%d元。[工作人员不会索取，请勿泄露]\",\n" +
                "\t\"code\": \"649844\"\n" +
                "}, {\n" +
                "\t\"address\": \"1069008109\",\n" +
                "\t\"body\": \"您在百度请求的验证码是：668993【百度】\",\n" +
                "\t\"code\": \"668993\"\n" +
                "}, {\n" +
                "\t\"address\": \"1069043009\",\n" +
                "\t\"body\": \"【百度】您在百度请求的验证码是：668993\",\n" +
                "\t\"code\": \"668993\"\n" +
                "}, {\n" +
                "\t\"address\": \"106550200108200\",\n" +
                "\t\"body\": \"565139（短信登录验证码），请勿转发，否则会导致QQ被盗。如不想接收此类短信，请回复TD退订。【腾讯科技】\",\n" +
                "\t\"code\": \"565139\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690275799569\",\n" +
                "\t\"body\": \"【素材天下】您的验证码是628016。如非本人操作，请忽略本短信\",\n" +
                "\t\"code\": \"628016\"\n" +
                "}, {\n" +
                "\t\"address\": \"106550200108235\",\n" +
                "\t\"body\": \"欢迎注册邮箱管理员，855952（注册验证码）回复T关闭提醒。【腾讯科技】\",\n" +
                "\t\"code\": \"855952\"\n" +
                "}, {\n" +
                "\t\"address\": \"106550591121880\",\n" +
                "\t\"body\": \"【阿里云邮】注册验证码是：311890，用于注册阿里云邮箱，请尽快提交您的验证码。为保证信息安全，切勿将验证码告知他人。\",\n" +
                "\t\"code\": \"311890\"\n" +
                "}, {\n" +
                "\t\"address\": \"106550200108200\",\n" +
                "\t\"body\": \"646548（短信登录验证码），请勿转发，否则会导致QQ被盗。如不想接收此类短信，请回复TD退订。【腾讯科技】\",\n" +
                "\t\"code\": \"646548\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690770011878\",\n" +
                "\t\"body\": \"【易迅网】易迅首页限时抢：天天十款，款款劲爆！App每日现金整点抢，速戳 http://dwz.cn/2qKMcW 回复QX退订\"\n" +
                "}, {\n" +
                "\t\"address\": \"+85264514528\",\n" +
                "\t\"body\": \"“G-630798”是您的 Google 验证码。\",\n" +
                "\t\"code\": \"G-630798\"\n" +
                "}, {\n" +
                "\t\"address\": \"10698000036509\",\n" +
                "\t\"body\": \"962083 (动态验证码),请在30分钟内填写【百度】\",\n" +
                "\t\"code\": \"962083\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690691036509\",\n" +
                "\t\"body\": \"【百度】846009 (动态验证码),请在30分钟内填写\",\n" +
                "\t\"code\": \"846009\"\n" +
                "}, {\n" +
                "\t\"address\": \"1069027521060\",\n" +
                "\t\"body\": \"【LeanCloud】预警：你在 LeanCloud 的应用 hosts 短信余额不足 60 元，请尽快充值。\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690275496093\",\n" +
                "\t\"body\": \"【hosts】您正在使用 hosts 服务进行短信认证，您的安全码是: 539010，请在 10 分钟内完成验证。\",\n" +
                "\t\"code\": \"539010\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690226999999\",\n" +
                "\t\"body\": \"534265（小米帐号安全验证，请勿将验证码提供给他人）【小米】\",\n" +
                "\t\"code\": \"534265\"\n" +
                "}, {\n" +
                "\t\"address\": \"10698000036509\",\n" +
                "\t\"body\": \"您在百度请求的验证码是：518149【百度】\",\n" +
                "\t\"code\": \"518149\"\n" +
                "}, {\n" +
                "\t\"address\": \"1069043009\",\n" +
                "\t\"body\": \"【百度】您在百度请求的验证码是：518149\",\n" +
                "\t\"code\": \"518149\"\n" +
                "}, {\n" +
                "\t\"address\": \"106904332089\",\n" +
                "\t\"body\": \"【听云】尊敬的会员：现听云APP专业版正式上线，10大全新功能开放，登录听云官网www.tingyun.com了解更多详情！\"\n" +
                "}, {\n" +
                "\t\"address\": \"10010\",\n" +
                "\t\"body\": \"温馨提示：截止12月13日24时，您当月累计使用流量%d.%dMB。其中，省内流量已使用%d.%dMB，剩余%d.%dMB； 回复“流量查询”或点击进入http://wap.10010.com 查询详情。\"\n" +
                "}, {\n" +
                "\t\"address\": \"1069004916400001\",\n" +
                "\t\"body\": \"【新东方在线】您的新东方在线账户*****正在进行找回密码操作，验证码为191539，请及时输入验证码进行下一步操作。\",\n" +
                "\t\"code\": \"191539\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690163\",\n" +
                "\t\"body\": \"9467 您的网易云音乐验证码，有效时间为10分钟，请尽快验证【网易】\",\n" +
                "\t\"code\": \"9467\"\n" +
                "}, {\n" +
                "\t\"address\": \"95188\",\n" +
                "\t\"body\": \"支付宝校验码：219625，打死都不能告诉别人哦！唯一热线95188【支付宝】\",\n" +
                "\t\"code\": \"219625\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690275493004\",\n" +
                "\t\"body\": \"【HostsV2】您正在使用 HostsV2 服务进行短信认证，您的安全码是: 579533，请在 10 分钟内完成验证。\",\n" +
                "\t\"code\": \"579533\"\n" +
                "}, {\n" +
                "\t\"address\": \"1069022511753647\",\n" +
                "\t\"body\": \"【SAE】尊敬的用户，您的充值折扣特权及免费云豆领用机会即将到期，请您在1天内登录使用。了解详情：http://t.cn/R4zYIy0\"\n" +
                "}, {\n" +
                "\t\"address\": \"95188\",\n" +
                "\t\"body\": \"支付宝校验码：721190，打死都不能告诉别人哦！唯一热线95188【支付宝】\",\n" +
                "\t\"code\": \"721190\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690275493004\",\n" +
                "\t\"body\": \"【HostsV2】您正在使用 HostsV2 服务进行短信认证，您的安全码是: 759433，请在 10 分钟内完成验证。\",\n" +
                "\t\"code\": \"759433\"\n" +
                "}, {\n" +
                "\t\"address\": \"1069027521060\",\n" +
                "\t\"body\": \"【LeanCloud】预警：你在 LeanCloud 的应用 HostsV2 短信余额不足 60 元，请尽快充值。\"\n" +
                "}, {\n" +
                "\t\"address\": \"1069063174313\",\n" +
                "\t\"body\": \"【云通讯】您的验证码为6443\",\n" +
                "\t\"code\": \"6443\"\n" +
                "}, {\n" +
                "\t\"address\": \"95188\",\n" +
                "\t\"body\": \"997746，守住校验码，打死都不要告诉别人哦！唯一热线95188。【支付宝】\",\n" +
                "\t\"code\": \"997746\"\n" +
                "}, {\n" +
                "\t\"address\": \"106557282\",\n" +
                "\t\"body\": \"尊敬的用户，如您本月使用流量超过500M，最高可抽取%d.%d元话费充值卡。精彩点击http://dwz.cn/TSU90\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690755132529\",\n" +
                "\t\"body\": \"【沪江网】同学，您的奖励学币将于%d.%d过期。现有课程学完，学费全返活动，用奖励学币报班最省钱哟！立戳 t.cn/RUdAlij 退订回T\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690755011878\",\n" +
                "\t\"body\": \"【易迅网】会员大人! 今天是我们约惠的日子，专享低价，无节操优惠券，点这里去看看 http://dwz.cn/2ivP2c 回复QX退订\"\n" +
                "}, {\n" +
                "\t\"address\": \"10010\",\n" +
                "\t\"body\": \"温馨提示：截止12月06日24时，您当月累计使用流量%d.%dMB。其中，省内流量已使用%d.%dMB，剩余%d.%dMB； 回复“流量查询”或点击进入http://wap.10010.com 查询详情。\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690691036509\",\n" +
                "\t\"body\": \"您激活百度帐号的验证码为624667，请在30分钟内填写【百度】\",\n" +
                "\t\"code\": \"624667\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690755132529\",\n" +
                "\t\"body\": \"【沪江网】同学，您有一次双12网校学员独享抽奖机会！拍立得、Kindle抱回家，百分百中奖哦~速来 t.cn/RUdAlij 退订回T\"\n" +
                "}, {\n" +
                "\t\"address\": \"10655019704100157\",\n" +
                "\t\"body\": \"【AcFun弹幕网】旧密码在记忆里生病啦，换掉它的验证码：985068，5分钟内有效\",\n" +
                "\t\"code\": \"985068\"\n" +
                "}, {\n" +
                "\t\"address\": \"10010\",\n" +
                "\t\"body\": \"温馨提示：您于01日10时18分充值（交费）20元。账户可用余额为33元，本月已消费0元。(点击进入 wap.10010.com 查询详情)\"\n" +
                "}, {\n" +
                "\t\"address\": \"10010\",\n" +
                "\t\"body\": \"704948(密码重置随机码)，请保密，并确认是本人操作[中国联通]\",\n" +
                "\t\"code\": \"704948\"\n" +
                "}, {\n" +
                "\t\"address\": \"+85264504321000\",\n" +
                "\t\"body\": \"您的 Google 验证代码为 712502\",\n" +
                "\t\"code\": \"712502\"\n" +
                "}, {\n" +
                "\t\"address\": \"10655059666\",\n" +
                "\t\"body\": \"***经支付宝向您尾号%d的中国光大银行卡成功转入%d.%d元，如有疑问可咨询银行确认。【支付宝】\"\n" +
                "}, {\n" +
                "\t\"address\": \"10010\",\n" +
                "\t\"body\": \"双十一联通感恩回馈，4G组合套餐老用户充值%d.%d元送50元，点击参与 u.10010.cn/1111，回复TD退订此类短信\"\n" +
                "}, {\n" +
                "\t\"address\": \"10698000036509\",\n" +
                "\t\"body\": \"您申请的手机验证码是： 518380 ，请输入后进行验证，谢谢 ！ 【百度】\",\n" +
                "\t\"code\": \"518380\"\n" +
                "}, {\n" +
                "\t\"address\": \"10010\",\n" +
                "\t\"body\": \"截止到11月14日6时，您流量已使用了%d.%dM，11月16日前关注“**联通”官方微信号，并首次绑定手机号就送您%d.%dG省内流量(绑定后三天内赠送，赠送流量在2015年12月底前均可使用)！\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690529100157\",\n" +
                "\t\"body\": \"【AcFun弹幕网】您正在注册的手机号码是18505672201,本次验证码为：160266，Ac小公举献上，5分钟内有效\",\n" +
                "\t\"code\": \"160266\"\n" +
                "}, {\n" +
                "\t\"address\": \"10010\",\n" +
                "\t\"body\": \"**联通网上营业厅双11活动太火爆啦,iphone6s直降%d.%d元,更多热销终端持续巨惠中,直接点击双11活动页面了解和办理http://u.10010.cn/qAaFw （**联通）\"\n" +
                "}, {\n" +
                "\t\"address\": \"1069004916410000\",\n" +
                "\t\"body\": \"【酷学网】学员好，如何让留学增值？新东方总裁周成刚今晚为你讲述我们为什么要留学，免费领课： http://t.cn/RUOQiDr 退订回N\"\n" +
                "}, {\n" +
                "\t\"address\": \"106550579360\",\n" +
                "\t\"body\": \"验证码：077719,您正在使用360移动开放平台，需要进行校验(请勿向任何人提供您收到的短信校验码)[360]\",\n" +
                "\t\"code\": \"077719\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690449219102359\",\n" +
                "\t\"body\": \"[GSMS]Your Google verification code is 3954\",\n" +
                "\t\"code\": \"3954\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690449219108057\",\n" +
                "\t\"body\": \"【TLSG】\\\"G-162864\\\"是您的 Google 验证码。\",\n" +
                "\t\"code\": \"G-162864\"\n" +
                "}, {\n" +
                "\t\"address\": \"106900722\",\n" +
                "\t\"body\": \"亲爱哒，双11提前啦！小酷送你%d.%d元红包，全场通用。学习不打折，快快行动吧！ www.koo.cn 退订回N【酷学网】\"\n" +
                "}, {\n" +
                "\t\"address\": \"106905782352449\",\n" +
                "\t\"body\": \"著名作家马伯庸开讲12星座和中国古代文化技术解读星座！亲王火力全开不容错过CC课堂免费预约听课 dwz.cn/27W8kn 退回T【沪江网】\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690701014011\",\n" +
                "\t\"body\": \"【盛大云】亲爱的用户，盛大云双11年终大促！主机11元/月、带宽11元/月起。不用对比，全网最低！预约地址：http://huodong.grandcloud.cn/zhujikuandai 退订回T\"\n" +
                "}, {\n" +
                "\t\"address\": \"106906466355\",\n" +
                "\t\"body\": \"【轻之文库】绑定手机验证码：9961（http://app.linovel.com/）\",\n" +
                "\t\"code\": \"9961\"\n" +
                "}, {\n" +
                "\t\"address\": \"+85264514923\",\n" +
                "\t\"body\": \"“G-406271”是您的 Google 验证码。\",\n" +
                "\t\"code\": \"G-406271\"\n" +
                "}, {\n" +
                "\t\"address\": \"106903002191057\",\n" +
                "\t\"body\": \"【TLSG】您的 Google 验证代码为 571286\",\n" +
                "\t\"code\": \"571286\"\n" +
                "}, {\n" +
                "\t\"address\": \"10010\",\n" +
                "\t\"body\": \"温馨提示：截止10月25日24时，您当月累计使用流量%d.%dMB。其中，省内流量已使用%d.%dMB，剩余%d.%dMB；套餐外流量计费达%d.%d元后不再计费并免费用至15GB后关闭数据网络。回复“流量查询”或点击进入http://wap.10010.com 查询详情。\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690164228119\",\n" +
                "\t\"body\": \"【%d.%d大促】千万优惠券提前领！时间已到，狂欢开始！详情查看 http://dwz.cn/24Fa03 回复QX退订【易迅】\"\n" +
                "}, {\n" +
                "\t\"address\": \"10655020011859\",\n" +
                "\t\"body\": \"296517，为您的QQ注册验证码，请您在30分钟内完成注册。如非本人操作，请忽略。【腾讯科技】\",\n" +
                "\t\"code\": \"296517\"\n" +
                "}, {\n" +
                "\t\"address\": \"10655059666\",\n" +
                "\t\"body\": \"***经支付宝向您尾号%d的中国光大银行卡转入%d.%d元。支付宝钱包转账免费、到账快 d.alipay.com/z 【支付宝】\"\n" +
                "}, {\n" +
                "\t\"address\": \"1069044323842\",\n" +
                "\t\"body\": \"亲爱的小蚂蚁，您的注册验证码：629088，有效期10分钟【蚂蚁公社APP】\",\n" +
                "\t\"code\": \"629088\"\n" +
                "}, {\n" +
                "\t\"address\": \"10655024113\",\n" +
                "\t\"body\": \"百度MTC提交任务验证码：5969【百度】\",\n" +
                "\t\"code\": \"5969\"\n" +
                "}, {\n" +
                "\t\"address\": \"106903002191057\",\n" +
                "\t\"body\": \"[TLSG]Your Google verification code is 7508\",\n" +
                "\t\"code\": \"7508\"\n" +
                "}, {\n" +
                "\t\"address\": \"10655059166107\",\n" +
                "\t\"body\": \"【阿里巴巴】您在CNZZ个人中心绑定手机，验证码：809376。请勿把验证码泄露给他人。如非本人操作，请忽略此短信。\",\n" +
                "\t\"code\": \"809376\"\n" +
                "}, {\n" +
                "\t\"address\": \"106903790429\",\n" +
                "\t\"body\": \"尊敬的 LeanCloud 用户，您的验证码为 200607，请在 10 分钟内输入完成验证。【LeanCloud】\",\n" +
                "\t\"code\": \"200607\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690301010\",\n" +
                "\t\"body\": \"5862(返利网验证码),有效期为1小时。为了保护您的账号安全,验证短信请勿转发他人 FanLi.com【返利网】\",\n" +
                "\t\"code\": \"5862\"\n" +
                "}, {\n" +
                "\t\"address\": \"1069060675500\",\n" +
                "\t\"body\": \"我是京东配送员：陈发刚，您的订单正在配送途中，请__准备__收货，联系电话：18326688530。【京东】\"\n" +
                "}, {\n" +
                "\t\"address\": \"10655059191\",\n" +
                "\t\"body\": \"尊敬的用户，您的余额为%d.%d元的百度开放云代金券（券号D1W8HBVL81FY3YK）已于2015-10-01到期。【百度】\"\n" +
                "}, {\n" +
                "\t\"address\": \"1069037505500\",\n" +
                "\t\"body\": \"我是京东配送员：陈发刚，您的订单正在配送途中，请__准备__收货，联系电话：18326688530。【京东】\"\n" +
                "}, {\n" +
                "\t\"address\": \"10655020051075\",\n" +
                "\t\"body\": \"977845（QQ注册验证码），请在20分钟内完成注册。如非本人操作，请忽略。【腾讯科技】\",\n" +
                "\t\"code\": \"977845\"\n" +
                "}, {\n" +
                "\t\"address\": \"106550200618548\",\n" +
                "\t\"body\": \"【新浪】您申请注册微博，验证码：237623（30分钟内有效）。\",\n" +
                "\t\"code\": \"237623\"\n" +
                "}, {\n" +
                "\t\"address\": \"10655059191\",\n" +
                "\t\"body\": \"尊敬的用户，您的余额为%d.%d元的百度开放云代金券（券号D1W8HBVL81FY3YK）将于2015-10-01到期，截至当前仅剩3天。请您尽快使用，感谢支持！【百度】\"\n" +
                "}, {\n" +
                "\t\"address\": \"10655024113\",\n" +
                "\t\"body\": \"百度MTC提交任务验证码：7353【百度】\",\n" +
                "\t\"code\": \"7353\"\n" +
                "}, {\n" +
                "\t\"address\": \"106550105310\",\n" +
                "\t\"body\": \"您用于学信网的手机校验码是121055,为保障账户安全,请不要泄漏给他人\",\n" +
                "\t\"code\": \"121055\"\n" +
                "}, {\n" +
                "\t\"address\": \"95188\",\n" +
                "\t\"body\": \"你的支付宝发生%d.%d元的交易，校验码：822460，打死都不能告诉别人哦！唯一热线95188【支付宝】\",\n" +
                "\t\"code\": \"822460\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690125760002270\",\n" +
                "\t\"body\": \"尊敬的JUJU用户“JUJU%d.%d”JU燃产品正式上线，炫酷的新界面，全新激燃版本！下载http://juju.la【巨聚网络】\"\n" +
                "}, {\n" +
                "\t\"address\": \"106902269995119\",\n" +
                "\t\"body\": \"尊敬的七牛用户：9月22日10点02分左右宁波机房骨干网络故障，导致部分客户受影响，已逐步恢复。稍后会发事故报告以及赔偿细则。[七牛云存储]【七牛云存储】\"\n" +
                "}, {\n" +
                "\t\"address\": \"10655059191\",\n" +
                "\t\"body\": \"尊敬的用户，您的余额为%d.%d元的百度开放云代金券（券号D529LT5QVDBS88H）已于2015-09-22到期。【百度】\"\n" +
                "}, {\n" +
                "\t\"address\": \"106903567333\",\n" +
                "\t\"body\": \"【上海富友】包裹尾号%d不远万里抵达物业办公室门口收件宝。亲,您特享4次短信取件体验(本次提取码552586)，点击fly.fuiou.com安装富友收件宝APP安全取件,限时抢购首单立减5元，客服4006677333转“5”\",\n" +
                "\t\"code\": \"552586\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690230600119\",\n" +
                "\t\"body\": \"【新东方在线】短信激活码是：605253,请填写到网上完成验证。\",\n" +
                "\t\"code\": \"605253\"\n" +
                "}, {\n" +
                "\t\"address\": \"10655059191\",\n" +
                "\t\"body\": \"尊敬的用户，您的余额为%d.%d元的百度开放云代金券（券号DWVAQ8V59YQJVMV）将于2015-09-22到期，截至当前仅剩7天。请您尽快使用，感谢支持！【百度】\"\n" +
                "}, {\n" +
                "\t\"address\": \"10655059191\",\n" +
                "\t\"body\": \"尊敬的用户，您的余额为%d.%d元的百度开放云代金券（券号D529LT5QVDBS88H）将于2015-09-22到期\"\n" +
                "}, {\n" +
                "\t\"address\": \"10655040201391\",\n" +
                "\t\"body\": \"【Coding】您的手机验证码是：603377\",\n" +
                "\t\"code\": \"603377\"\n" +
                "}, {\n" +
                "\t\"address\": \"95188\",\n" +
                "\t\"body\": \"支付宝校验码：336095，你正在修改账户信息，打死都不能告诉别人哦！唯一热线95188【支付宝】\",\n" +
                "\t\"code\": \"336095\"\n" +
                "}, {\n" +
                "\t\"address\": \"10655077163358848\",\n" +
                "\t\"body\": \"尊敬的会员： 10万种中小学教辅、童书满100减20，最高直减%d.%d元。详情 http://t.cn/RLk9B2p 回复TD退订【当当】\"\n" +
                "}, {\n" +
                "\t\"address\": \"1069032972\",\n" +
                "\t\"body\": \"您购买的应用引擎BAE(订单编号：ec7b7d9d15d84afaba64bd35bb277910)已创建成功。[百度]\"\n" +
                "}, {\n" +
                "\t\"address\": \"1069032972\",\n" +
                "\t\"body\": \"验证码为：192547，感谢您使用百度开放云服务，请填写完成验证。[百度]\",\n" +
                "\t\"code\": \"192547\"\n" +
                "}, {\n" +
                "\t\"address\": \"1001022\",\n" +
                "\t\"body\": \"“使用手机营业厅，运动手环等您拿”活动火热进行中！关注“**联通”官方微信查询7月中奖名单。手厅网址 wap.10010.com\"\n" +
                "}, {\n" +
                "\t\"address\": \"1069043632\",\n" +
                "\t\"body\": \"尊敬的用户，重要事情说三遍，盛大云充值送钻石的活动，时间已经不多了，云主机包年再送1个月免费时长，错过再等一年，赶快来参加吧 www.grandcloud.cn ‘退订回T’【盛大云】\"\n" +
                "}, {\n" +
                "\t\"address\": \"1065507716059173\",\n" +
                "\t\"body\": \"您的验证码是 499197 (21:06过期)，您正在删除空间 acgn。【七牛云存储】\",\n" +
                "\t\"code\": \"499197\"\n" +
                "}, {\n" +
                "\t\"address\": \"1069040804436252449\",\n" +
                "\t\"body\": \"【盛大云】尊敬的客户：今年七夕过不一样的情人节，盛大云充值送钻戒，助你成功脱单！戳官网参加活动 www.grandcloud.cn 退订回T\"\n" +
                "}, {\n" +
                "\t\"address\": \"1065505774182101\",\n" +
                "\t\"body\": \"验证码：117507，网易用户，您正在使用手机帐号登入服务(工作人员不会向您索取，请勿泄露)。【网易】\",\n" +
                "\t\"code\": \"117507\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690275403345\",\n" +
                "\t\"body\": \"【空文网】您的验证码是356526。有效期为10分钟，请尽快验证。\",\n" +
                "\t\"code\": \"356526\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690226999999\",\n" +
                "\t\"body\": \"352722（小米帐号安全验证，请勿将验证码提供给他人）【小米】\",\n" +
                "\t\"code\": \"352722\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690286011563\",\n" +
                "\t\"body\": \"小米帐号注册手机验证码 6934【小米】\",\n" +
                "\t\"code\": \"6934\"\n" +
                "}, {\n" +
                "\t\"address\": \"10010\",\n" +
                "\t\"body\": \"**联通温馨提醒：如您本月使用流量超过500M，最高可抽取iPhone%d.%d元话费充值卡。精彩点击http://dwz.cn/TSU90\"\n" +
                "}, {\n" +
                "\t\"address\": \"10655020074106\",\n" +
                "\t\"body\": \"您的验证码是：8105。请不要把验证码泄露给其他人。【毒药】\",\n" +
                "\t\"code\": \"8105\"\n" +
                "}, {\n" +
                "\t\"address\": \"10010\",\n" +
                "\t\"body\": \"您的账户余额%d.%d元,账户可用余额：%d.%d元 账户明细: 合约返还话费 :%d.%d元 合约未返还话费 :%d.%d元 可用预存款 :%d.%d元 合约款 :%d.%d元 发送“CZ#充值卡密码”至10010即可充值。 【流量王推荐入网送30元话费 http://u.10010.cn/qAadW】\"\n" +
                "}, {\n" +
                "\t\"address\": \"10655020051075\",\n" +
                "\t\"body\": \"230583（QQ注册验证码），请在20分钟内完成注册。如非本人操作，请忽略。[腾讯科技]\",\n" +
                "\t\"code\": \"230583\"\n" +
                "}, {\n" +
                "\t\"address\": \"1001022\",\n" +
                "\t\"body\": \"抽大礼、乐自助，流量、话费轻松查！即日起使用联通手机营业厅即有机会抽取神秘礼品！手厅下载网址 wap.10010.com 。询联通营业厅\"\n" +
                "}, {\n" +
                "\t\"address\": \"10010\",\n" +
                "\t\"body\": \"**联通温馨提醒：如您本月使用流量超过500M，最高可抽取iPhone%d.%d元话费充值卡。精彩点击http://dwz.cn/TSU90\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690204403395\",\n" +
                "\t\"body\": \"【轻文网】您的验证码是685627。有效期为3分钟，请尽快验证。\",\n" +
                "\t\"code\": \"685627\"\n" +
                "}, {\n" +
                "\t\"address\": \"1069020421060\",\n" +
                "\t\"body\": \"【LeanCloud】预警：你在 LeanCloud 的应用 轻文 短信余额不足 60 元，请尽快充值。\"\n" +
                "}, {\n" +
                "\t\"address\": \"1069008109\",\n" +
                "\t\"body\": \"验证码：392344 【百度】\",\n" +
                "\t\"code\": \"392344\"\n" +
                "}, {\n" +
                "\t\"address\": \"1065502411309\",\n" +
                "\t\"body\": \"您申请的手机验证码是： 217607 ，请输入后进行验证，谢谢 ！ 【百度】\",\n" +
                "\t\"code\": \"217607\"\n" +
                "}, {\n" +
                "\t\"address\": \"1065502411390\",\n" +
                "\t\"body\": \"帐号（26...4@qq.com）的密保手机185******01解绑成功，同时不能再用此手机号进行登录。如需重新绑定，请用电脑登录passport.baidu.com进行修改。【百度】\"\n" +
                "}, {\n" +
                "\t\"address\": \"1069008109\",\n" +
                "\t\"body\": \"您在百度请求的验证码是：609088【百度】\",\n" +
                "\t\"code\": \"609088\"\n" +
                "}, {\n" +
                "\t\"address\": \"10698000036509\",\n" +
                "\t\"body\": \"110558 (动态验证码),请在30分钟内填写【百度】\",\n" +
                "\t\"code\": \"110558\"\n" +
                "}, {\n" +
                "\t\"address\": \"10010\",\n" +
                "\t\"body\": \"尊敬的客户：您所反映的问题，我们已反馈至相关部门处理中，有进一步的结果会第一时间与您联系.感谢您的支持！<**联通客服中心>\"\n" +
                "}, {\n" +
                "\t\"address\": \"10655024113\",\n" +
                "\t\"body\": \"您的任务验证码是：Z3Wmu<百度移动云测试中心>【百度】\",\n" +
                "\t\"code\": \"Z3Wmu\"\n" +
                "}, {\n" +
                "\t\"address\": \"1065502411340\",\n" +
                "\t\"body\": \"您在百度开发者中心进行的手机验证的验证码为：209822，请输入后进行验证，谢谢！[百度开发者中心]【百度】\",\n" +
                "\t\"code\": \"209822\"\n" +
                "}, {\n" +
                "\t\"address\": \"10010\",\n" +
                "\t\"body\": \"温馨提示：您于11日16时02分充值（交费）20元。账户可用余额为38元，本月已消费23元。(点击进入 wap.10010.com 查询详情)\"\n" +
                "}, {\n" +
                "\t\"address\": \"10010\",\n" +
                "\t\"body\": \"**联通温馨提醒：如您本月使用流量超过500M，最高可抽取iPhone%d.%d元话费充值卡。精彩点击http://dwz.cn/TSU90\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690416228119\",\n" +
                "\t\"body\": \"感谢您耐心等待荣耀4C订单，特奉上华为原装线控带麦耳塞式耳机券(商品编号101-005-46072),请在7月31日前使用。【易迅】\"\n" +
                "}, {\n" +
                "\t\"address\": \"10655077296601911\",\n" +
                "\t\"body\": \"【有赞】亲，小店为您准备了77美食趴，补贴您%d.%d元启动基金，仅限两天！立即查看?http://kdt.im/PYqLHMK3x 退订回TD\"\n" +
                "}, {\n" +
                "\t\"address\": \"10655010187452448\",\n" +
                "\t\"body\": \"您的手机验证码是：588288，验证码有效时长为10分钟，10分钟后请重新点击发送验证码进行验证。【上海贝锐】\",\n" +
                "\t\"code\": \"588288\"\n" +
                "}, {\n" +
                "\t\"address\": \"10698000036509\",\n" +
                "\t\"body\": \"您在百度申请绑定手机的验证码是307066【百度】\",\n" +
                "\t\"code\": \"307066\"\n" +
                "}, {\n" +
                "\t\"address\": \"106550200741599\",\n" +
                "\t\"body\": \"你的 Facebook 验证码为 816994【CEG】\",\n" +
                "\t\"code\": \"816994\"\n" +
                "}, {\n" +
                "\t\"address\": \"1069013338586666\",\n" +
                "\t\"body\": \"您的手机验证码为：9591 (20分钟内有效)【盛大云】\",\n" +
                "\t\"code\": \"9591\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690067120832\",\n" +
                "\t\"body\": \"绑定手机号码验证码260381【草料二维码】\",\n" +
                "\t\"code\": \"260381\"\n" +
                "}, {\n" +
                "\t\"address\": \"1065502001082430020\",\n" +
                "\t\"body\": \"234658（微信开放平台验证码，十分钟内有效）[腾讯科技]\",\n" +
                "\t\"code\": \"234658\"\n" +
                "}, {\n" +
                "\t\"address\": \"106902046780\",\n" +
                "\t\"body\": \"【搜狐快站】您的验证码是835144。如非本人操作，请忽略本短信\",\n" +
                "\t\"code\": \"835144\"\n" +
                "}, {\n" +
                "\t\"address\": \"106550102033161592\",\n" +
                "\t\"body\": \"尊敬的客户.智齿全体祝您生意兴隆.端午安康!全球首款智慧客服欢迎您免费试用.网址:www.sobot.com4008690981【智齿客服】\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690163\",\n" +
                "\t\"body\": \"7777 您的网易云音乐验证码，有效时间为10分钟，请尽快验证【网易】\",\n" +
                "\t\"code\": \"7777\"\n" +
                "}, {\n" +
                "\t\"address\": \"106557282\",\n" +
                "\t\"body\": \"尊敬的用户，为提升您的生活品质和乐趣，向您推荐最热门的应用及最新搞笑视频，精彩点击 http://ah.kk3g.net/i/1/m0DmRcI1\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690416228196\",\n" +
                "\t\"body\": \"当当年中庆尾品汇两周年%d.%d折疯，千余专柜品牌震撼来袭！童书童装童鞋，北面等亲子游装备超值抢 t.cn/R2jvFIm 回TD退订【当当】\"\n" +
                "}, {\n" +
                "\t\"address\": \"1065507716059173\",\n" +
                "\t\"body\": \"您的验证码是 573290 (10:14过期)，您正在绑定此手机。【七牛云存储】\",\n" +
                "\t\"code\": \"573290\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690133372250\",\n" +
                "\t\"body\": \"426734（设备锁验证码），用于QQ25*******0登录的设备锁验证，请勿转发。如不想接收此类短信，请回复T退订[腾讯科技]\",\n" +
                "\t\"code\": \"426734\"\n" +
                "}, {\n" +
                "\t\"address\": \"1069070069\",\n" +
                "\t\"body\": \"QQ29*******1正在绑定QQ安全中心,验证码134646(请勿在电脑上输入,泄露会被盗)-QQ安全中心[腾讯科技]\",\n" +
                "\t\"code\": \"134646\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690275021502\",\n" +
                "\t\"body\": \"【智齿科技】您的验证码是317318\",\n" +
                "\t\"code\": \"317318\"\n" +
                "}, {\n" +
                "\t\"address\": \"10655020051075\",\n" +
                "\t\"body\": \"507939（QQ注册验证码），请在20分钟内完成注册。如非本人操作，请忽略。[腾讯科技]\",\n" +
                "\t\"code\": \"507939\"\n" +
                "}, {\n" +
                "\t\"address\": \"10655020030857661\",\n" +
                "\t\"body\": \"听云申请验证码：108664，请勿泄露。【听云】\",\n" +
                "\t\"code\": \"108664\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690133372250\",\n" +
                "\t\"body\": \"586359（设备锁验证码），用于QQ10*******6登录的设备锁验证，请勿转发。如不想接收此类短信，请回复T退订[腾讯科技]\",\n" +
                "\t\"code\": \"586359\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690163\",\n" +
                "\t\"body\": \"4196 您的网易云音乐验证码，有效时间为10分钟，请尽快验证【网易】\",\n" +
                "\t\"code\": \"4196\"\n" +
                "}, {\n" +
                "\t\"address\": \"106905705937384\",\n" +
                "\t\"body\": \"【巨聚网络】欢迎来到JUJU二次元~master你的验证码是:755091 希望您在JUJU玩的愉快，请不要大意的和小伙伴们一起捡！肥！皂！\",\n" +
                "\t\"code\": \"755091\"\n" +
                "}, {\n" +
                "\t\"address\": \"10010\",\n" +
                "\t\"body\": \"联通517网购节全场1折起，10元抢1G流量，爆款手机超优惠，错过等一年！马上点击http://10010.com/0517\"\n" +
                "}, {\n" +
                "\t\"address\": \"10698000951546\",\n" +
                "\t\"body\": \"您好!您刚刚通过SAE在线管理平台申请修改资料的验证码为piusdn,请尽快完成操作.【新浪】\",\n" +
                "\t\"code\": \"piusdn\"\n" +
                "}, {\n" +
                "\t\"address\": \"106550101874228118\",\n" +
                "\t\"body\": \"亲爱的易迅用户：手机校验码为961387，请提交验证码完成验证。如有疑问拨打客服热线：400-828-1878。【易迅】\",\n" +
                "\t\"code\": \"961387\"\n" +
                "}, {\n" +
                "\t\"address\": \"1065515899\",\n" +
                "\t\"body\": \"005304是您的音悦台初始登录密码，为了您的账号安全，请及时修改密码。【音悦Tai】\",\n" +
                "\t\"code\": \"005304\"\n" +
                "}, {\n" +
                "\t\"address\": \"1065515899\",\n" +
                "\t\"body\": \"005304是您的音悦Tai身份验证码，有效期为10分钟，如非本人操作，请忽略。【音悦Tai】\",\n" +
                "\t\"code\": \"005304\"\n" +
                "}, {\n" +
                "\t\"address\": \"18919635560\",\n" +
                "\t\"body\": \"您的乐享礼包于%d.%d到期，内含10元券和25-3充值券，还没领？戳 sq.jd.com/9QVczw 回TD退订[京东]\"\n" +
                "}, {\n" +
                "\t\"address\": \"1069008079\",\n" +
                "\t\"body\": \"豌豆荚激活码 288338 ，请输入激活码完成密码更改。【豌豆荚】\",\n" +
                "\t\"code\": \"288338\"\n" +
                "}, {\n" +
                "\t\"address\": \"1069008079\",\n" +
                "\t\"body\": \"成功注册豌豆荚账号，初始密码为 28tUYC62，你可以点此修改密码 http://wandou.im/jwp3w\t【豌豆荚】\",\n" +
                "\t\"code\": \"28tUYC62\"\n" +
                "}, {\n" +
                "\t\"address\": \"10690999368\",\n" +
                "\t\"body\": \"【努比亚】努比亚官方网站提醒您：您申请的手机验证码为280121,请在页面中提交验证码完成验证\",\n" +
                "\t\"code\": \"280121\"\n" +
                "}, {\n" +
                "\t\"address\": \"10655057868\",\n" +
                "\t\"body\": \"***经支付宝钱包向您尾号为2981的中国邮政储蓄银行卡转入%d.%d元。了解支付宝钱包请点击 d.alipay.com/t 【支付宝】\"\n" +
                "}, {\n" +
                "\t\"address\": \"106550200379\",\n" +
                "\t\"body\": \"【问卷网】注册验证码 742859【问卷网】\",\n" +
                "\t\"code\": \"742859\"\n" +
                "}, {\n" +
                "\t\"address\": \"1069013345500\",\n" +
                "\t\"body\": \"尊敬的客户，您的服务单146167504未能通过审核。您可在京东网站首页右上角点击“我的京东”-“客户服务”-“返修/退换货”查看审核留言【易迅】\"\n" +
                "}, {\n" +
                "\t\"address\": \"1069013315500\",\n" +
                "\t\"body\": \"验证码为539038，请在页面中正确输入以完成手机验证，如有问题请发邮件至 jcloud@jd.com。欢迎使用京东云服务！【京东】\",\n" +
                "\t\"code\": \"539038\"\n" +
                "}, {\n" +
                "\t\"address\": \"1069013315500\",\n" +
                "\t\"body\": \"验证码为384533，请在注册页面中输入以完成注册【京东】\",\n" +
                "\t\"code\": \"384533\"\n" +
                "}, {\n" +
                "\t\"address\": \"10655059338304\",\n" +
                "\t\"body\": \"5194 (手机QQ短信验证码，正在启用通讯录功能。为了保证帐号安全，请勿向他人泄漏。如非本人操作，请忽略。）【腾讯科技】\",\n" +
                "\t\"code\": \"5194\"\n" +
                "}, {\n" +
                "\t\"address\": \"95188\",\n" +
                "\t\"body\": \"您正在使用支付宝，但密码控件不支持当前环境，为了资金安全，需手机校验。校验码467117【请勿向任何人提供短信校验码】【支付宝】\",\n" +
                "\t\"code\": \"467117\"\n" +
                "}, {\n" +
                "\t\"address\": \"95580\",\n" +
                "\t\"body\": \"您正在使用邮储银行支付宝快捷支付，付款金额%d.%d元，验证码：654558。[工作人员不会索取，请勿泄露]【邮储银行】\",\n" +
                "\t\"code\": \"654558\"\n" +
                "}, {\n" +
                "\t\"address\": \"14796805293\",\n" +
                "\t\"body\": \"会员亲，森马邀您一起乘坐2014神马列车，沿途经过健康、幸福、平安、好运等站台，祝愿每一站都收获满满，快乐到家！【森马官方旗舰店】\"\n" +
                "}, {\n" +
                "\t\"address\": \"95599\",\n" +
                "\t\"body\": \"您尾号%d的农行账户于01月20日完成一笔短信费交易，金额为-%d.%d，余额%d.%d。【中国农业银行】\"\n" +
                "}, {\n" +
                "\t\"address\": \"106590571168\",\n" +
                "\t\"body\": \"478093（手机淘宝登录验证码），请注意保密，10分钟内有效【手机淘宝】【淘宝网】\",\n" +
                "\t\"code\": \"478093\"\n" +
                "}, {\n" +
                "\t\"address\": \"95188\",\n" +
                "\t\"body\": \"740129（支付宝短信校验码，请勿泄露），需要你进行身份校验。如非本人操作，请致电95188。【支付宝】\",\n" +
                "\t\"code\": \"740129\"\n" +
                "}, {\n" +
                "\t\"address\": \"95580\",\n" +
                "\t\"body\": \"您正在使用邮储银行支付宝快捷支付，付款金额%d.%d元，验证码：654558。[工作人员不会索取，请勿泄露]【邮储银行】\",\n" +
                "\t\"code\": \"654558\"\n" +
                "}, {\n" +
                "\t\"address\": \"1069070069\",\n" +
                "\t\"body\": \"本次验证码:132974 ,请勿告知他人.\",\n" +
                "\t\"code\": \"132974\"\n" +
                "}, {\n" +
                "\t\"address\": \"15178282424\",\n" +
                "\t\"body\": \"用气请注意一开三关,即打开厨房窗户,用完气后关灶具开关、灶前阀、厨房门。节日外出请关闭表前阀。祝您新春快乐！【**燃气】\"\n" +
                "}, {\n" +
                "\t\"address\": \"14796805293\",\n" +
                "\t\"body\": \"会员亲，森马邀您一起乘坐2014神马列车，沿途经过健康、幸福、平安、好运等站台，祝愿每一站都收获满满，快乐到家！【森马官方旗舰店】\"\n" +
                "}, {\n" +
                "\t\"address\": \"95599\",\n" +
                "\t\"body\": \"您尾号%d的农行账户于01月20日完成一笔短信费交易，金额为-%d.%d，余额%d.%d。【中国农业银行】\"\n" +
                "}, {\n" +
                "\t\"address\": \"106590571168\",\n" +
                "\t\"body\": \"478093（手机淘宝登录验证码），请注意保密，10分钟内有效【手机淘宝】【淘宝网】\",\n" +
                "\t\"code\": \"478093\"\n" +
                "}, {\n" +
                "\t\"address\": \"106906061263\",\n" +
                "\t\"body\": \"验证码：604667。欢迎您注册 Smartisan 账户，为保障您的账户安全，请勿将此验证短信转发给他人。【锤子科技】\",\n" +
                "\t\"code\": \"604667\"\n" +
                "}]", MSG.class);
    }
}
